In [1]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv('C:\\Users\\Alexander\\Desktop\\Alexan\\Coding\\Data and ML\\Datasets\\World University Rankings 2023.csv')

In [10]:
df.head()

,University Rank,Name of University,Location,No of student,No of student per staff,International Student,Female:Male Ratio,OverAll Score,Teaching Score,Research Score,Citations Score,Industry Income Score,International Outlook Score
0,1,University of Oxford,United Kingdom,"20,965",10.6,42%,48 : 52,96.4,92.3,99.7,99.0,74.9,96.2
1,2,Harvard University,United States,"21,887",9.6,25%,50 : 50,95.2,94.8,99.0,99.3,49.5,80.5
2,3,University of Cambridge,United Kingdom,"20,185",11.3,39%,47 : 53,94.8,90.9,99.5,97.0,54.2,95.8
3,3,Stanford University,United States,"16,164",7.1,24%,46 : 54,94.8,94.2,96.7,99.8,65.0,79.8
4,5,Massachusetts Institute of Technology,United States,"11,415",8.2,33%,40 : 60,94.2,90.7,93.6,99.8,90.9,89.3

In [9]:
df.shape

(2341, 13)

In [13]:
df.isna().sum()

University Rank                  0
Name of University             108
Location                       294
No of student                  132
No of student per staff        133
International Student          132
Female:Male Ratio              213
OverAll Score                  542
Teaching Score                 542
Research Score                 542
Citations Score                542
Industry Income Score          542
International Outlook Score    542
dtype: int64

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2341 entries, 0 to 2340
Data columns (total 13 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   University Rank              2341 non-null   object
 1   Name of University           2233 non-null   object
 2   Location                     2047 non-null   object
 3   No of student                2209 non-null   object
 4   No of student per staff      2208 non-null   float64
 5   International Student        2209 non-null   object
 6   Female:Male Ratio            2128 non-null   object
 7   OverAll Score                1799 non-null   object
 8   Teaching Score               1799 non-null   float64
 9   Research Score               1799 non-null   float64
 10  Citations Score              1799 non-null   float64
 11  Industry Income Score        1799 non-null   float64
 12  International Outlook Score  1799 non-null   float64
dtypes: float64(6), object(7)
memory usage: 237.9+ KB

In [15]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
No of student per staff,2208.0,19.000408,12.132224,0.4,12.6,16.6,22.20,232.2
Teaching Score,1799.0,27.018010,13.282243,11.6,18.0,22.7,31.85,94.8
Research Score,1799.0,23.016898,16.763819,7.4,11.3,17.0,28.90,99.7
Citations Score,1799.0,48.495887,27.967185,0.8,23.1,47.2,72.35,100.0
Industry Income Score,1799.0,47.104558,15.093682,36.9,37.8,40.5,48.30,100.0
International Outlook Score,1799.0,46.880378,22.582401,14.1,27.9,42.1,62.10,99.7

In [16]:
df.describe()

,No of student per staff,Teaching Score,Research Score,Citations Score,Industry Income Score,International Outlook Score
count,2208.000000,1799.000000,1799.000000,1799.000000,1799.000000,1799.000000
mean,19.000408,27.018010,23.016898,48.495887,47.104558,46.880378
std,12.132224,13.282243,16.763819,27.967185,15.093682,22.582401
min,0.400000,11.600000,7.400000,0.800000,36.900000,14.100000
25%,12.600000,18.000000,11.300000,23.100000,37.800000,27.900000
50%,16.600000,22.700000,17.000000,47.200000,40.500000,42.100000
75%,22.200000,31.850000,28.900000,72.350000,48.300000,62.100000
max,232.200000,94.800000,99.700000,100.000000,100.000000,99.700000

In [35]:
df['Location'].value_counts().loc[lambda x: x >= 10]

United States     173
Japan             150
United Kingdom    149
India              91
China              82
Turkey             75
Brazil             73
Iran               63
Spain              57
Nigeria            56
Pakistan           55
Italy              51
Germany            45
Iraq               44
France             44
Egypt              40
Taiwan             39
Poland             34
Uzbekistan         29
Ukraine            28
Colombia           27
Chile              26
Australia          25
Thailand           25
Mexico             25
Algeria            24
Indonesia          23
Romania            22
Saudi Arabia       21
South Korea        20
Malaysia           20
Canada             19
Czech Republic     19
Greece             18
Portugal           16
Bangladesh         15
Switzerland        14
Sweden             13
Ecuador            13
Austria            12
Jordan             12
Morocco            10
Hungary            10
South Africa       10
Name: Location, dtype: int64